In [4]:
import pandas as pd
col_names=['sl_no','age','gender','role','id']
data=pd.read_table("/home/ila/PycharmProjects/pythonworks/artificialintelligence/pandas/files/ex.txt",sep="|",names=col_names)
data.dtypes

/home/ila/anaconda3/envs/featurebranch/lib/python3.6/site-packages/ipykernel_launcher.py:3: FutureWarning: read_table is deprecated, use read_csv instead.
  This is separate from the ipykernel package so we can avoid doing imports until

sl_no      int64
age        int64
gender    object
role      object
id        object
dtype: object

In [6]:
data.head()

   sl_no  age gender        role     id
0      1   24      M  technician  85711
1      2   53      F       other  94043
2      3   23      M      writer  32067
3      4   24      M  technician  43537
4      5   33      F       other  15213

In [8]:
data.age= data.age.astype(float)
data.head()

   sl_no   age gender        role     id
0      1  24.0      M  technician  85711
1      2  53.0      F       other  94043
2      3  23.0      M      writer  32067
3      4  24.0      M  technician  43537
4      5  33.0      F       other  15213

#### Data type can be specified while loading data

#### id is object(string) so replacing any non digit with 3 and converting to float

In [41]:
data1= pd.read_table("/home/ila/PycharmProjects/pythonworks/artificialintelligence/pandas/files/ex.txt", sep='|', names= col_names, dtype={'age':float, 'sl_no':float})
data1.head()

/home/ila/anaconda3/envs/featurebranch/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: read_table is deprecated, use read_csv instead.
  """Entry point for launching an IPython kernel.

   sl_no   age gender        role     id
0    1.0  24.0      M  technician  85711
1    2.0  53.0      F       other  94043
2    3.0  23.0      M      writer  32067
3    4.0  24.0      M  technician  43537
4    5.0  33.0      F       other  15213

In [42]:
# data.id= data.id.str.replace('\D','3')
data.id.head()

0    33333
1    33333
2    33333
3    33333
4    33333
Name: id, dtype: object

In [44]:
data.id= data.id.astype(float)
data.dtypes

sl_no       int64
age       float64
gender     object
role       object
id        float64
dtype: object

In [46]:
data.describe

<bound method NDFrame.describe of      sl_no   age gender           role       id
0        1  24.0      M     technician  33333.0
1        2  53.0      F          other  33333.0
2        3  23.0      M         writer  33333.0
3        4  24.0      M     technician  33333.0
4        5  33.0      F          other  33333.0
5        6  42.0      M      executive  33333.0
6        7  57.0      M  administrator  33333.0
7        8  36.0      M  administrator  33333.0
8        9  29.0      M        student  33333.0
9       10  53.0      M         lawyer  33333.0
10      11  39.0      F          other  33333.0
11      12  28.0      F          other  33333.0
12      13  47.0      M       educator  33333.0
13      14  45.0      M      scientist  33333.0
14      15  49.0      F       educator  33333.0
15      16  21.0      M  entertainment  33333.0
16      17  30.0      M     programmer  33333.0
17      18  35.0      F          other  33333.0
18      19  40.0      M      librarian  33333.0
19      20  42.0      F      homemaker  33333.0
20      21  26.0      M         writer  33333.0
21      22  25.0      M         writer  33333.0
22      23  30.0      F         artist  33333.0
23      24  21.0      F         artist  33333.0
24      25  39.0      M       engineer  33333.0
25      26  49.0      M       engineer  33333.0
26      27  40.0      F      librarian  33333.0
27      28  32.0      M         writer  33333.0
28      29  41.0      M     programmer  33333.0
29      30   7.0      M        student  33333.0
..     ...   ...    ...            ...      ...
913    914  44.0      F          other  33333.0
914    915  50.0      M  entertainment  33333.0
915    916  27.0      M       engineer  33333.0
916    917  22.0      F        student  33333.0
917    918  40.0      M      scientist  33333.0
918    919  25.0      M          other  33333.0
919    920  30.0      F         artist  33333.0
920    921  20.0      F        student  33333.0
921    922  29.0      F  administrator  33333.0
922    923  21.0      M        student  33333.0
923    924  29.0      M          other  33333.0
924    925  18.0      F       salesman  33333.0
925    926  49.0      M  entertainment  33333.0
926    927  23.0      M     programmer  33333.0
927    928  21.0      M        student  33333.0
928    929  44.0      M      scientist  33333.0
929    930  28.0      F      scientist  33333.0
930    931  60.0      M       educator  33333.0
931    932  58.0      M       educator  33333.0
932    933  28.0      M        student  33333.0
933    934  61.0      M       engineer  33333.0
934    935  42.0      M         doctor  33333.0
935    936  24.0      M          other  33333.0
936    937  48.0      M       educator  33333.0
937    938  38.0      F     technician  33333.0
938    939  26.0      F        student  33333.0
939    940  32.0      M  administrator  33333.0
940    941  20.0      M        student  33333.0
941    942  48.0      F      librarian  33333.0
942    943  22.0      M        student  33333.0

[943 rows x 5 columns]>